TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ВнешняяПроба/гкс_ВнешняяПроба.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ВнешняяПроба</name>
  <registerRecords>InformationRegister.гкс_ВнешниеПробы</registerRecords>
  <registerRecords>InformationRegister.гкс_ВнешниеПробыПоЗаявкамНаПеревозку</registerRecords>
  <registerRecords>InformationRegister.гкс_КонтрольЗаполненияВнешнихПроб</registerRecords>
  <attributes>
    <name>ДатаПогрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияWarehouse</name>
    <type>
      <types>CatalogRef.гкс_КонтрагентыWarehouse</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураWarehouse</name>
    <type>
      <types>CatalogRef.гкс_ПродукцияWarehouse</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДКомпозитнойПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияОтправления</name>
    <type>
      <types>CatalogRef.гкс_КлассификаторСтанцийЖД</types>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияОтправленияWarehouse</name>
    <type>
      <types>CatalogRef.гкс_СтанцииWarehouse</types>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияНазначения</name>
    <type>
      <types>CatalogRef.гкс_КлассификаторСтанцийЖД</types>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияНазначенияWarehouse</name>
    <type>
      <types>CatalogRef.гкс_СтанцииWarehouse</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сюрвейер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СюрвейерWarehouse</name>
    <type>
      <types>CatalogRef.гкс_КонтрагентыWarehouse</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <comment>Контрольная сумма MD5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоИнспекции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетныйВидПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Элеватор</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлеваторWarehouse</name>
    <type>
      <types>CatalogRef.гкс_КонтрагентыWarehouse</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗаявок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗерновоза</name>
    <comment>Для поиска</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПрицепа</name>
    <comment>Для поиска</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КачественныеПоказатели</name>
    <attributes>
      <name>ТипВнешнейПробы</name>
      <type>
        <types>CatalogRef.гкс_ТипыВнешнихПробWarehouse</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПробы</name>
      <type>
        <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательВнешний</name>
      <type>
        <types>CatalogRef.гкс_ПоказателиКачестваWarehouse</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаявкиНаПеревозку</name>
    <attributes>
      <name>НомерЗаявки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыТранспортныхСредствДоставки/гкс_ТипыТранспортныхСредствДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыТранспортныхСредствДоставки</name>
  <enumValues>
    <name>Автомобиль</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
  <enumValues>
    <name>ЖДТранспорт</name>
  </enumValues>
  <enumValues>
    <name>Самолёт</name>
  </enumValues>
  <enumValues>
    <name>БезДоставки</name>
  </enumValues>
  <enumValues>
    <name>Трубопровод</name>
  </enumValues>
  <enumValues>
    <name>Контейнер</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыОбъектовWarehouse/гкс_ТипыОбъектовWarehouse.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыОбъектовWarehouse</name>
  <enumValues>
    <name>Организация</name>
  </enumValues>
  <enumValues>
    <name>Станция</name>
  </enumValues>
  <enumValues>
    <name>Сюрвейер</name>
  </enumValues>
  <enumValues>
    <name>Элеватор</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_СтанцииWarehouse/гкс_СтанцииWarehouse.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_СтанцииWarehouse</name>
  <attributes>
    <name>КодЕСР</name>
    <comment>Код единой сетевой разметки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторWarehouse</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_КонтрагентыWarehouse/гкс_КонтрагентыWarehouse.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_КонтрагентыWarehouse</name>
  <attributes>
    <name>ИдентификаторWarehouse</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>EnumRef.гкс_ТипыОбъектовWarehouse</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_ПродукцияWarehouse/гкс_ПродукцияWarehouse.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_ПродукцияWarehouse</name>
  <attributes>
    <name>НаименованиеEN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКороткое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКороткоеEN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативныйДокумент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторWarehouse</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_ТипыВнешнихПробWarehouse/гкс_ТипыВнешнихПробWarehouse.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_ТипыВнешнихПробWarehouse</name>
  <predefined>
    <items>
      <name>ПробаПервогоДня</name>
      <description>1-й день</description>
    </items>
    <items>
      <name>Лаборант</name>
      <description>Лаборант</description>
    </items>
    <items>
      <name>ЛотНаТысячуТон</name>
      <description>Лот на 1000т </description>
    </items>
    <items>
      <name>Элеватор</name>
      <description>Элеватор</description>
    </items>
  </predefined>
  <attributes>
    <name>ИдентификаторWarehouse</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеEN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКомпозит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_ПоказателиКачестваWarehouse/гкс_ПоказателиКачестваWarehouse.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_ПоказателиКачестваWarehouse</name>
  <predefined>
    <items>
      <name>ПротеинЭкспрессЗерновыеМасличные</name>
      <description>Протеин (экспресс зерновые + масличные)</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеКороткое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.гкс_ЕдиницыИзмеренияWarehouse</types>
    </type>
  </attributes>
  <attributes>
    <name>Стандарт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Точность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗависимыйПоказатель</name>
    <type>
      <types>CatalogRef.гкс_ПоказателиКачестваWarehouse</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерхнийПределЗависимогоПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НижнийПределЗависимогоПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодWarehouse</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторWarehouse</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеEN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКороткоеEN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяДиспетчером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСпециалистомПоКачеству</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВСортировке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ВнешняяПроба/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вычисляет контрольную сумму документа для защиты от несанкционированных изменений
//
// Возвращаемое значение:
//   Строка - контрольная сумма документа
//
Функция КонтрольнаяСуммаДокумента() Экспорт
	
	КонтролируемыеДанные = Новый Структура;
	КонтролируемыеДанные.Вставить("Дата", 			Дата);
	КонтролируемыеДанные.Вставить("ДатаПогрузки", 	ДатаПогрузки);
	КонтролируемыеДанные.Вставить("ДатаИзменения", 	ДатаИзменения);
	
	КонтролируемыеДанные.Вставить("Номенклатура", 	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
								НоменклатураWarehouse, "ИдентификаторWarehouse"));
								
    КонтролируемыеДанные.Вставить("НомерТС", 		НомерТС);
	КонтролируемыеДанные.Вставить("ИДКомпозитнойПробы", ИДКомпозитнойПробы);
	КонтролируемыеДанные.Вставить("ИДПробы", 			ИДПробы);
	КонтролируемыеДанные.Вставить("НомерЗаявки", 		НомерЗаявки);
	КонтролируемыеДанные.Вставить("НомерДокумента", 	НомерДокумента);
	
	ТабЧастьПоказатели = КачественныеПоказатели.Выгрузить(, "ВидПробы, ПоказательВнешний, Значение");
	КонтролируемыеДанные.Вставить("КачественныеПоказатели", 
									ОбщегоНазначения.ТаблицаЗначенийВМассив(ТабЧастьПоказатели));
									
	Возврат Документы.гкс_ВнешняяПроба.КонтрольнаяСумма(КонтролируемыеДанные);								
	
КонецФункции
	
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	КонтрольнаяСумма = КонтрольнаяСуммаДокумента();	
	ЗаполнитьНомераПоискаАвтотранспорта();
	НормализоватьВес();
		
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	гкс_ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
				
	гкс_ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	гкс_ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	КонтрольнаяСумма = "";
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область СообщенияWarehouse

// Правило конвертации в реквизит
// 
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_ТранспортноеСредство(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт
	
	Перем ПолученноеЗначение;
	
	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда
		
		ДанныеЗаполнения.Вставить("ВидПеревозки", гкс_ОбменДаннымиWarehouse.ВидПеревозки(ПолученноеЗначение));	
		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.ТранспортноеСредствоПоНомерИзWarehouse(ПолученноеЗначение);			
		ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
					
	КонецЕсли;	
	
КонецПроцедуры

// Правило конвертации в реквизит
// 
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_НомерЗаявки(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт
	
	Перем ПолученноеЗначение;
	
	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда
		
		ЗаявкиНаПеревозку.Очистить();
		ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ПолученноеЗначение);
			
		НомераЗаявок = гкс_ОбменДаннымиWarehouse.НомераЗаявокНаПеревозкуВМассив(ПолученноеЗначение);
		Для Каждого ЗаявкаНомер Из НомераЗаявок Цикл
			НоваяСтрока = ЗаявкиНаПеревозку.Добавить();
			НоваяСтрока.НомерЗаявки = ЗаявкаНомер;
		КонецЦикла;
		
		ДанныеЗаполнения.Вставить("КоличествоЗаявок", НомераЗаявок.Количество());

	КонецЕсли;	
	
КонецПроцедуры

// Правило конвертации в реквизит
// 
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_СтанцияОтправленияWarehouse(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт
	
	Перем ПолученноеЗначение;
	
	ЗначениеЗаполнения = Справочники.гкс_КлассификаторСтанцийЖД.ПустаяСсылка();
	
	Если ДанныеЗаполнения.Свойство("ВидПеревозки")
		И ДанныеЗаполнения.ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт 
		И ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда
		
		СтанцииWarehouseМенеджер = Справочники.гкс_СтанцииWarehouse;
		ЗначениеЗаполнения = СтанцииWarehouseМенеджер.СтанцияWarehouseПоИдентификатору(ПолученноеЗначение);
		
		ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
		ДанныеЗаполнения.Вставить("СтанцияОтправления", СтанцииWarehouseМенеджер.СтанцияКлассификатор(ЗначениеЗаполнения));
	КонецЕсли;
		
КонецПроцедуры

// Правило конвертации в реквизит
// 
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_СтанцияНазначенияWarehouse(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт
	
	Перем ПолученноеЗначение;
	
	ЗначениеЗаполнения = Справочники.гкс_КлассификаторСтанцийЖД.ПустаяСсылка();
	
	Если ДанныеЗаполнения.Свойство("ВидПеревозки")
		И ДанныеЗаполнения.ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт 
		И ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда
		
		СтанцииWarehouseМенеджер = Справочники.гкс_СтанцииWarehouse;
		ЗначениеЗаполнения = СтанцииWarehouseМенеджер.СтанцияWarehouseПоИдентификатору(ПолученноеЗначение);
		
		ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
		ДанныеЗаполнения.Вставить("СтанцияНазначения", СтанцииWarehouseМенеджер.СтанцияКлассификатор(ЗначениеЗаполнения));
	КонецЕсли;
		
КонецПроцедуры

// Правило конвертации в реквизит
// 
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_СюрвейерWarehouse(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт
	
	Перем ПолученноеЗначение;
	
	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда
		
		ЗначениеЗаполнения = Справочники.гкс_КонтрагентыWarehouse.ЭлементПоВнешнимДанным(
			ПолученноеЗначение, Перечисления.гкс_ТипыОбъектовWarehouse.Сюрвейер);
					
		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда		
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);	
			ДанныеЗаполнения.Вставить("Сюрвейер", РегистрыСведений.гкс_СоответствиеОбъектовWarehouse.
				СсылкаОбъектаПоСсылкеWarehouse(ЗначениеЗаполнения)); 
		Иначе
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, 
				Справочники.гкс_КонтрагентыWarehouse.ПустаяСсылка());			
			ДанныеЗаполнения.Вставить("Сюрвейер", Справочники.Контрагенты.ПустаяСсылка());			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Правило конвертации в реквизит
// 
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_ОрганизацияWarehouse(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт
		
	Перем ПолученноеЗначение;
	
	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда
		
		ЗначениеЗаполнения = Справочники.гкс_КонтрагентыWarehouse.ЭлементПоВнешнимДанным(
			ПолученноеЗначение, Перечисления.гкс_ТипыОбъектовWarehouse.Организация);
					
		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда		
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);	
			ДанныеЗаполнения.Вставить("Организация", РегистрыСведений.гкс_СоответствиеОбъектовWarehouse.
				СсылкаОбъектаПоСсылкеWarehouse(ЗначениеЗаполнения)); 
		Иначе
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, 
				Справочники.гкс_КонтрагентыWarehouse.ПустаяСсылка());			
			ДанныеЗаполнения.Вставить("Организация", Справочники.Организации.ПустаяСсылка());			
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПКС_ЭлеваторWarehouse(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт
	
	Перем ПолученноеЗначение;
	
	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда
		
		ЗначениеЗаполнения = Справочники.гкс_КонтрагентыWarehouse.ЭлементПоВнешнимДанным(
			ПолученноеЗначение, Перечисления.гкс_ТипыОбъектовWarehouse.Элеватор);
					
		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда		
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);	
			ДанныеЗаполнения.Вставить("Элеватор", РегистрыСведений.гкс_СоответствиеОбъектовWarehouse.
				СсылкаОбъектаПоСсылкеWarehouse(ЗначениеЗаполнения)); 
		Иначе
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, 
				Справочники.гкс_КонтрагентыWarehouse.ПустаяСсылка());			
			ДанныеЗаполнения.Вставить("Элеватор", Справочники.гкс_ТочкиМаршрута.ПустаяСсылка());			
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

// Правило конвертации в реквизит
// 
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_НоменклатураWarehouse(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт
	
	Перем ПолученноеЗначение;	
	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда
		
		ПолноеИмяОбъектаСвойства = "Справочник.гкс_ПродукцияWarehouse";
		ДанныеЗаполненияСвойства = Новый Структура;
		ДанныеЗаполненияСвойства.Вставить(Справочники.гкс_ПродукцияWarehouse.ИмяКлючевогоСвойства(), 
			ПолученноеЗначение); 
		ДанныеЗаполненияСвойства.Вставить("НаименованиеКороткое", ПолученныеДанные.goodShortName); 
		ДанныеЗаполненияСвойства.Вставить("Наименование", ПолученныеДанные.goodName); 
		
		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.ЭлементПоВнешнимДанным(ПолноеИмяОбъектаСвойства, 
			ПолученноеЗначение, ДанныеЗаполненияСвойства);
			
		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
			
			// Номенклатура
			ДанныеЗаполнения.Вставить("Номенклатура", РегистрыСведений.гкс_СоответствиеОбъектовWarehouse.
				СсылкаОбъектаПоСсылкеWarehouse(ЗначениеЗаполнения)); 	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

// Правило конвертации в реквизит
// 
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_ТипВнешнейПробы(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт
	
	Перем ПолученноеЗначение;	
	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда
		
		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.СсылкаНаОбъектПоИдентификатору(ПолученноеЗначение.id, 
		  "Справочник.гкс_ТипыВнешнихПробWarehouse");
		
		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
			
			// вид пробы 
			ДанныеЗаполнения.Вставить("ВидПробы", гкс_ОбменДаннымиWarehouse.
				КонвертацияПредопределенныхТиповПроб(ЗначениеЗаполнения));
		Иначе		
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, 
				Справочники.гкс_ТипыВнешнихПробWarehouse.ПустаяСсылка());
				
			ДанныеЗаполнения.Вставить("ВидПробы", Перечисления.гкс_НазначенияИспользованияКачества.ПустаяСсылка());	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

// Правило конвертации в реквизит
// 
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_ПоказательКачестваWarehouse(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт
	
	Перем ПолученноеЗначение;
	
	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда
		
		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.СсылкаНаОбъектПоИдентификатору(ПолученноеЗначение, 
		  "Справочник.гкс_ПоказателиКачестваWarehouse");
		
		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
			
			// Показатель
			ДанныеЗаполнения.Вставить("Показатель", РегистрыСведений.гкс_СоответствиеОбъектовWarehouse.
				СсылкаОбъектаПоСсылкеWarehouse(ЗначениеЗаполнения)); 
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьНомераПоискаАвтотранспорта()
	
	Если ВидПеревозки <> Перечисления.гкс_ТипыТранспортныхСредствДоставки.Автомобиль Тогда
		Возврат;
	КонецЕсли;
	
	НомераАвтоИПрицепа = гкс_ПриемкаТранспорта.НомерТранспортногоСредстваВСтруктуру(НомерТС); 
	НомерЗерновоза = НомераАвтоИПрицепа.НомерЗерновоза;
	НомерПрицепа = НомераАвтоИПрицепа.НомерПрицепа;
		    	
КонецПроцедуры

// Приводит вес к значению в килограммах
//
Процедура НормализоватьВес()
	
	Тонна = 1000;
	Если (ВесБрутто <= Тонна) И (ВесТары <= Тонна) И (ВесНетто <= Тонна) Тогда
		
		ВесБрутто = ВесБрутто * Тонна;
		ВесТары = ВесТары * Тонна;
		ВесНетто = ВесНетто * Тонна;
		
	КонецЕсли;	
	
КонецПроцедуры	
	
#КонецОбласти

#КонецЕсли
